---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Macros.ApplicationEntryPoint
source: html/5b26a8b9-af01-ec6a-fcbc-452e2a55c77d.htm
---
# ApplicationEntryPoint Members

Initializes a new instance of the ApplicationEntryPoint class